<h1>Finding our best-performing salespeople and products</h1>

<h2>Introduction</h2>

<p><strong>Business Context.</strong> You work for AdventureWorks, a company that sells outdoor sporting equipment. The company has many different locations and has been recording the sales of different locations on various products. You, their new data scientist, have been tasked with the question: <strong>"What are our best products and salespeople and how can use this information to improve our overall performance?"</strong></p>
<p>You have been given access to the relevant data files with documentation from the IT department. Your job is to extract meaningful insights from these data files to help increase sales. First, you will look at the best products and try to see how different products behave in different categories. Second, you will analyze the best salespeople to see if the commission percentage motivates them to sell more.</p>

<p><strong>Business Problem.</strong> Your task is to <strong>construct a database from the provided CSV files and then write queries in SQL to carry out the requested analysis</strong>.</p>

<p><strong>Analytical Context.</strong> You are given the data (stored in the <code>data/csvs</code> folder) as a set of separate CSV files, each one representing a table. You will build a new PostgreSQL database from these files using AWS RDS.</p>
<p>The company has been pretty vague about how they expect you to extract insights, but you have come up with the following plan of attack:</p>
<ol>
<li>Create the database and ensure you can run basic queries against it</li>
<li>Look at how product ratings and total sales are related</li>
<li>See how products sell in different subcategories (bikes, helmets, socks, etc.)</li>
<li>Calculate which salespeople have performed the best in the past year</li>
<li>Seeing if total sales are correlated with their commission percentage</li>
</ol>
<p>Of course, this is only your initial plan. As you explore the database, your strategy will change.</p>

<h2>Setting up AWS</h2>

<p>In this case, we'll assume that the company has given you an entry-level laptop, which is not capable of running a PostgreSQL server locally. Therefore, you should set up a cloud database, connect to it from <code>psql</code>, and run the analysis via the <code>psql</code> or directly from the notebook.</p>

<h3>Question :</h3>
<p>Repeat the steps in Case 12.3 to create a new RDS instance with a PostgreSQL database.</p>

<h2>Overview of the data</h2>

<p>The data for the case is contained in the <code>./data/csvs</code> directory; specifically, it is the <code>AdventureWorks</code> sample data provided by Microsoft. We will be focusing on the Sales and Production categories. Complete documentation for the original data (of which you have only a subset) can be found <a href="https://dataedo.com/download/AdventureWorks.pdf">here</a>. </p>
<p><strong>Product Tables:</strong>
* <strong>Product</strong>: one row per product that the company sells
* <strong>ProductReview</strong>: one row per rating and review left by customers
* <strong>ProductModelProductDescriptionCulture</strong>: a link between products and their longer descriptions also indicating a "culture" - which language and region the product is for
* <strong>ProductDescription</strong>: a longer description of each product, for a specific region
* <strong>ProductCategory</strong>: the broad categories that products fit into
* <strong>ProductSubCategory</strong>: the narrower subcategories that products fit into</p>
<p><strong>Sales Tables:</strong>
* <strong>SalesPerson</strong>: one row per salesperson, including information on their commission and performance
* <strong>SalesOrderHeader</strong>: one row per sale summarizing the sale
* <strong>SalesOrderDetail</strong>: many rows per sale, detailing each product that forms part of the sale
* <strong>SalesTerritory</strong>: the different territories where products are sold, including performance</p>
<p><strong>Region Tables:</strong>
* <strong>CountryRegionCurrency</strong>: the currency used by each region
* <strong>CurrencyRate</strong>: the average and closing exchange rates for each currency compared to the USD</p>

<h2>Using <code>ipython-sql</code> and <code>pgspecial</code></h2>
<p>Jupyter notebook is usually used to run Python code, but with an add-on it can run SQL directly against a database too. The extensions <code>ipython-sql</code> and <code>pgspecial</code> will let you do this.</p>

<p>Load the sql add-on and connect to the database as follows. You'll need to change the username (<code>postgres</code>), password (<code>mysecretpassword</code>), host (<code>localhost</code>), and database name (<code>postgres</code>) to what you used when setting up your RDS instance:</p>

In [20]:
!pip install scipy
!pip install ipython-sql 
!pip install pgspecial

Requirement already satisfied: scipy in /opt/conda/lib/python3.6/site-packages (1.1.0)
Collecting ipython-sql
  Downloading https://files.pythonhosted.org/packages/ab/3d/0d38357c620df31cebb056ca1804027112e5c008f4c2c0e16d879996ad9f/ipython_sql-0.4.0-py3-none-any.whl
Collecting prettytable<1 (from ipython-sql)
  Downloading https://files.pythonhosted.org/packages/ef/30/4b0746848746ed5941f052479e7c23d2b56d174b82f4fd34a25e389831f5/prettytable-0.7.2.tar.bz2
Collecting sqlparse (from ipython-sql)
  Downloading https://files.pythonhosted.org/packages/85/ee/6e821932f413a5c4b76be9c5936e313e4fc626b33f16e027866e1d60f588/sqlparse-0.3.1-py2.py3-none-any.whl (40kB)
    100% |████████████████████████████████| 40kB 933kB/s ta 0:00:01
Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /opt/conda/lib/python3.6/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /opt/conda/lib/python3.6/site-packages (from ipython-sql) (1.2.15)
Requirement already satisfied: ipython>=1.0 in /opt/conda/lib/python3.6/site-packages (from ipython-sql) (7.2.0)
Requirement already satisfied: setuptools>=18.5 in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (40.6.3)
Requirement already satisfied: jedi>=0.10 in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.13.2)
Requirement already satisfied: decorator in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.3.0)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: prompt_toolkit<2.1.0,>=2.0.0 in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.0.7)
Requirement already satisfied: pygments in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.3.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: pexpect in /opt/conda/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.6.0)
Requirement already satisfied: parso>=0.3.0 in /opt/conda/lib/python3.6/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.3.1)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.6/site-packages (from prompt_toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.6/site-packages (from pexpect->ipython>=1.0->ipython-sql) (0.6.0)
Building wheels for collected packages: prettytable
  Running setup.py bdist_wheel for prettytable ... done
  Stored in directory: /home/jovyan/.cache/pip/wheels/80/34/1c/3967380d9676d162cb59513bd9dc862d0584e045a162095606
Successfully built prettytable
Installing collected packages: prettytable, sqlparse, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.3.1
Collecting pgspecial
  Downloading https://files.pythonhosted.org/packages/34/70/f20df1e335592ace0e4f54989307d1630163445599b6abd43a2e0149d483/pgspecial-1.11.10-py3-none-any.whl
Collecting click>=4.1 (from pgspecial)
  Downloading https://files.pythonhosted.org/packages/d2/3d/fa76db83bf75c4f8d338c2fd15c8d33fdd7ad23a9b5e57eb6c5de26b430e/click-7.1.2-py2.py3-none-any.whl (82kB)
    100% |████████████████████████████████| 92kB 2.1MB/s ta 0:00:01
Requirement already satisfied: sqlparse>=0.1.19 in /opt/conda/lib/python3.6/site-packages (from pgspecial) (0.3.1)
Requirement already satisfied: psycopg2>=2.7.4 in /opt/conda/lib/python3.6/site-packages (from pgspecial) (2.8.6)
Installing collected packages: click, pgspecial
Successfully installed click-7.1.2 pgspecial-1.11.10

In [21]:
%load_ext sql
%sql postgresql://postgres:fidelina123@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres

<p>You should now be able to run SQL directly from any Jupyter notebook cell by starting the cell with a line that states <code>%%sql</code>. For example (once you have a database with some tables, which we'll only create later):</p>
<div class="codehilite"><pre><span></span><code><span class="o">%%</span><span class="k">sql</span>

<span class="k">SELECT</span> <span class="o">*</span> <span class="k">FROM</span> <span class="n">product</span> <span class="k">LIMIT</span> <span class="mi">10</span><span class="p">;</span>
</code></pre></div>


<p><strong>Note:</strong> Unlike <code>pandas</code> which automatically truncates output for large DataFrames, the SQL plug-in gives you exactly what you ask for. If you do a <code>SELECT * FROM</code> a table with a million rows and no <code>LIMIT</code> clause, it'll output all million rows and probably freeze your notebook. It's good practice to always use a <code>LIMIT</code> clause even when it's not needed to avoid any mishaps.</p>

<h2>Creating the database and adding the tables</h2>
<p>Now, let's create a database called <code>adventuretime</code>. (If you do this through the notebook, you'll have to add the line <code>end;</code> before your <code>create database</code> command as the add-on runs everything in transactions).</p>
<p>You'll need to add a table for each of the CSV files. Spend some time looking at the different CSV files and getting used to how they reference each other and what headers they create. Then, you'll need to write an appropriate <code>CREATE TABLE</code> command with appropriate types. You can figure out the types by inspecting the CSV files and/or referencing the documentation.</p>

<h3>Exercise 1:</h3>
<p>Write all of the commands that you need to</p>
<ul>
<li>Create the database</li>
<li>Create the tables</li>
<li>Import the data from the CSVs</li>
</ul>
<p><strong>Hint:</strong> As an example, to add data for the <code>salesperson</code> table, you would use the following commands:</p>
<ol>
<li>Create table (can be run from Jupyter Notebook or the <code>psql</code> command line interface):</li>

<div class="codehilite"><pre><span></span><code><span class="k">CREATE</span> <span class="k">TABLE</span> <span class="n">salesperson</span> <span class="p">(</span>
    <span class="n">businessentityid</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">territoryid</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">salesquota</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">bonus</span> <span class="nb">INTEGER</span><span class="p">,</span>
    <span class="n">commissionpct</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">salesytd</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">saleslastyear</span> <span class="nb">FLOAT</span><span class="p">,</span>
    <span class="n">rowguid</span> <span class="nb">TEXT</span><span class="p">,</span>
    <span class="n">modifieddate</span> <span class="nb">DATE</span>
    <span class="p">);</span>
</code></pre></div>



<li>Copy data (has to be run from the <code>psql</code> shell):</li>
</ol>
<div class="codehilite"><pre><span></span><code><span class="err">\</span><span class="k">copy</span> <span class="n">salesperson</span> <span class="k">FROM</span> <span class="s1">&#39;data/csvs/salesperson.csv&#39;</span> <span class="k">with</span> <span class="p">(</span><span class="n">format</span> <span class="n">CSV</span><span class="p">,</span> <span class="n">header</span> <span class="k">true</span><span class="p">,</span> <span class="k">delimiter</span> <span class="s1">&#39;,&#39;</span><span class="p">);</span>
</code></pre></div>

**Answer.**

create database adventuretime;


CREATE TABLE salesperson (businessentityid INTEGER,territoryid INTEGER,salesquota INTEGER,bonus INTEGER,commissionpct FLOAT,salesytd FLOAT,saleslastyear FLOAT,rowguid TEXT,modifieddate DATE);

CREATE TABLE countryregioncurrency (countryregioncode VARCHAR(2),currencycode VARCHAR(3),modifieddate DATE);

CREATE TABLE currencyrate(currencyrateid INTEGER,currencyratedate DATE,fromcurrencycode VARCHAR(3),tocurrencycode VARCHAR(3),averagerate FLOAT,endofdayrate FLOAT,modifieddate DATE);

CREATE TABLE product(productid INTEGER,name TEXT,productnumber TEXT,makeflag VARCHAR(1),finishedgoodsflag VARCHAR(1),color TEXT,safetystocklevel INTEGER,reorderpoint INTEGER,standardcost FLOAT,listprice FLOAT,size VARCHAR(2),sizeunitmeasurecode VARCHAR(2),weightunitmeasurecode VARCHAR(2),weight FLOAT,daystomanufacture INTEGER,productline VARCHAR(1),class VARCHAR(1),style VARCHAR(1),productsubcategoryid INTEGER,productmodelid INTEGER,sellstartdate DATE,sellenddate DATE,discontinueddate DATE,rowguid TEXT,modifieddate DATE);

CREATE TABLE productcategory(productcategoryid INTEGER,name VARCHAR(15),rowguid TEXT,modifieddate DATE);

CREATE TABLE productdescription(productdescriptionid INTEGER,description TEXT,rowguid TEXT,modifieddate DATE);

CREATE TABLE productmodelproductdescriptionculture(productmodelid INTEGER,productdescriptionid INTEGER,cultureid VARCHAR(15),modifieddate DATE);

CREATE TABLE productreview (productreviewid INTEGER,productid INTEGER,reviewername TEXT,reviewdate DATE,emailaddress TEXT,rating INTEGER,comments TEXT,modifieddate DATE);

CREATE TABLE productsubcategory (productsubcategoryid INTEGER,productcategoryid INTEGER,name TEXT ,rowguid TEXT,modifieddate DATE);

CREATE TABLE salesorderdetail (salesorderid INTEGER,salesorderdetailid INTEGER,carriertrackingnumber TEXT,orderqty INTEGER,productid INTEGER,specialofferid INTEGER,unitprice FLOAT,unitpricediscount FLOAT,rowguid TEXT,modifieddate DATE);

CREATE TABLE salesorderheader (salesorderid INTEGER,revisionnumber INTEGER,orderdate DATE,duedate DATE,shipdate DATE,status INTEGER,onlineorderflag VARCHAR(1),purchaseordernumber TEXT,accountnumber TEXT,customerid INTEGER,salespersonid INTEGER,territoryid INTEGER,billtoaddressid INTEGER,shiptoaddressid INTEGER,shipmethodid INTEGER,creditcardid INTEGER,creditcardapprovalcode TEXT,currencyrateid INTEGER,subtotal FLOAT,taxamt FLOAT,freight FLOAT,totaldue FLOAT,comment TEXT,rowguid TEXT,modifieddate DATE);

CREATE TABLE salesterritory (territoryid INTEGER,name VARCHAR(14),countryregioncode VARCHAR(2),group VARCHAR(13),salesytd TEXT,saleslastyear TEXT,costytd INTEGER,costlastyear INTEGER,rowguid TEXT,modifieddate DATE);

\copy salesperson FROM 'data/csvs/salesperson.csv' with (format CSV, header true, delimiter ',');
\copy countryregioncurrency FROM 'countryregioncurrency.csv' with (format CSV, header true, delimiter ',');
\copy currencyrate FROM 'currencyrate.csv' with (format CSV, header true, delimiter ',');
\copy product FROM 'product.csv' with (format CSV, header true, delimiter ',');
\copy productcategory FROM 'productcategory.csv' with (format CSV, header true, delimiter ',');
\copy productdescription FROM 'productdescription.csv' with (format CSV, header true, delimiter ',');
\copy productmodelproductdescriptionculture FROM 'productmodelproductdescriptionculture.csv' with (format CSV, header true, delimiter ',');
\copy productreview FROM 'productreview.csv' with (format CSV, header true, delimiter ',');
\copy productsubcategory FROM 'productsubcategory.csv' with (format CSV, header true, delimiter ',');
\copy salesorderdetail FROM 'salesorderdetail.csv' with (format CSV, header true, delimiter ',');
\copy salesorderheader FROM 'salesorderheader.csv' with (format CSV, header true, delimiter ',');
\copy salesterritory FROM 'salesterritory.csv' with (format CSV, header true, delimiter ',');

In [104]:
%%sql

-- CHECK TO MAKE SURE THE DATA IS LOADED AS EXPECTED
select * from product limit 10;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
10 rows affected.

[(1, 'Adjustable Race', 'AR-5381', 'f', 'f', None, 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '694215b7-08f7-4c0d-acb1-d734ba44c0c8', datetime.date(2014, 2, 8)),
 (2, 'Bearing Ball', 'BA-8327', 'f', 'f', None, 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '58ae3c20-4f3a-4749-a7d4-d568806cc537', datetime.date(2014, 2, 8)),
 (3, 'BB Ball Bearing', 'BE-2349', 't', 'f', None, 800, 600, 0.0, 0.0, None, None, None, None, 1, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '9c21aed2-5bfa-4f18-bcb8-f11638dc2e4e', datetime.date(2014, 2, 8)),
 (4, 'Headset Ball Bearings', 'BE-2908', 'f', 'f', None, 800, 600, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, 'ecfed6cb-51ff-49b5-b06c-7d8ac834db8b', datetime.date(2014, 2, 8)),
 (316, 'Blade', 'BL-2036', 't', 'f', None, 800, 600, 0.0, 0.0, None, None, None, None, 1, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, 'e73e9750-603b-4131-89f5-3dd15ed5ff80', datetime.date(2014, 2, 8)),
 (317, 'LL Crankarm', 'CA-5965', 'f', 'f', 'Black', 500, 375, 0.0, 0.0, None, None, None, None, 0, None, 'L', None, None, None, datetime.date(2008, 4, 30), None, None, '3c9d10b7-a6b2-4774-9963-c19dcee72fea', datetime.date(2014, 2, 8)),
 (318, 'ML Crankarm', 'CA-6738', 'f', 'f', 'Black', 500, 375, 0.0, 0.0, None, None, None, None, 0, None, 'M', None, None, None, datetime.date(2008, 4, 30), None, None, 'eabb9a92-fa07-4eab-8955-f0517b4a4ca7', datetime.date(2014, 2, 8)),
 (319, 'HL Crankarm', 'CA-7457', 'f', 'f', 'Black', 500, 375, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '7d3fd384-4f29-484b-86fa-4206e276fe58', datetime.date(2014, 2, 8)),
 (320, 'Chainring Bolts', 'CB-2903', 'f', 'f', 'Silver', 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '7be38e48-b7d6-4486-888e-f53c26735101', datetime.date(2014, 2, 8)),
 (321, 'Chainring Nut', 'CN-6137', 'f', 'f', 'Silver', 1000, 750, 0.0, 0.0, None, None, None, None, 0, None, None, None, None, None, datetime.date(2008, 4, 30), None, None, '3314b1d7-ef69-4431-b6dd-dc75268bd5df', datetime.date(2014, 2, 8))]

<h2>Finding our most popular products</h2>

<p>As discussed, the company would like to know which of their products is the most popular among customers. You figure that the average rating given in reviews is correlated with the number of sales of a particular product (that products with higher reviews have more sales).</p>

<h3>Exercise 2:</h3>
<p>Using the <code>product</code> and <code>productreview</code> tables, <code>JOIN</code> them and rank the products according to their average review rating. What are the names and IDs of the top 5 products?</p>

**Answer.**

In [53]:
%%sql
select p2.productid, name, avg(rating) as Avg, productmodelid  as M from product as p1 join productreview as p2 on p1.productid=p2.productid GROUP BY p2.productid, p1.name, p1.productmodelid  ORDER BY Avg DESC  ;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
3 rows affected.

[(709, 'Mountain Bike Socks, M', Decimal('5.0000000000000000'), 18),
 (798, 'Road-550-W Yellow, 40', Decimal('5.0000000000000000'), 29),
 (937, 'HL Mountain Pedal', Decimal('3.0000000000000000'), 64)]

<h3>Exercise 3:</h3>
<p>Much to your disappointment, there are only three products with ratings and only four reviews in total! This is nowhere near enough to perform an analysis of the correlation between reviews and total sales.</p>
<p>Nevertheless, your manager wants the <strong>English description</strong> of these products for an upcoming sale. Use the documentation provided above if you need help navigating the structure to extract this!</p>
<p><strong>Hint:</strong> You'll notice that the value for <code>cultureid</code> in the <code>productmodelproductdescriptionculture</code> table often has extra trailing spaces which makes it difficult to reliably get descriptions of a specific language. You should first modify this table before writing the <code>SELECT</code> statement to get the descriptions that your manager wants. To do this, you can use an <code>UPDATE</code> statement with Postgres's <a href="https://w3resource.com/PostgreSQL/trim-function.php"><code>TRIM</code></a> function.</p>

**Answer.**

In [52]:
%%sql
UPDATE productmodelproductdescriptionculture SET cultureid=TRIM(cultureid)  ;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
762 rows affected.

[]

In [60]:
%%sql

select b.productid,b.name,b.avg,description from
    (select * from(
        select p2.productid, name, avg(rating) as Avg, productmodelid as m from product as p1 join
         productreview as p2 on p1.productid=p2.productid GROUP BY p2.productid, p1.name, p1.productmodelid  ORDER BY Avg DESC) a
    join productmodelproductdescriptionculture on productmodelid=m where cultureid='en') b
join productdescription as p on p.productdescriptionid=b.productdescriptionid
;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
3 rows affected.

[(709, 'Mountain Bike Socks, M', Decimal('5.0000000000000000'), 'Combination of natural and synthetic fibers stays dry and provides just the right cushioning.'),
 (798, 'Road-550-W Yellow, 40', Decimal('5.0000000000000000'), 'Same technology as all of our Road series bikes, but the frame is sized for a woman.  Perfect all-around bike for road or racing.'),
 (937, 'HL Mountain Pedal', Decimal('3.0000000000000000'), 'Stainless steel; designed to shed mud easily.')]

<h3>Exercise 4:</h3>
<p>Since we cannot infer the most popular products from the reviews, we will go with an alternative strategy.</p>
<p>Get the model ID, name, description, and total number of sales for each product and display the top-10 selling products. You can infer how often products have been sold by looking at the <code>salesorderdetail</code> table (each row might indicate more than one sale, so take note of <code>OrderQty</code>).</p>

**Answer.**

In [70]:
%%sql
select b.m, b.name,p.description,b.Total from(
    select m, a.name,productdescriptionid as n,a.Total from
        (select p1.productmodelid as m,p1.name, SUM(OrderQty) as Total from product as p1 
        join salesorderdetail as p2 on p1.productid=p2.productid 
        GROUP BY p1.productid,p2.productid,p1.name,p1.productmodelid ORDER BY Total DESC LIMIT 10) a
    join productmodelproductdescriptionculture on productmodelid=m where cultureid='en') b
join productdescription as p on productdescriptionid=n ORDER BY Total DESC LIMIT 10
    ;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
10 rows affected.

[(2, 'AWC Logo Cap', 'Traditional style with a flip-up brim; one-size fits all.', 8311),
 (111, 'Water Bottle - 30 oz.', 'AWC logo water bottle - holds 30 oz; leak-proof.', 6815),
 (33, 'Sport-100 Helmet, Blue', 'Universal fit, well-vented, lightweight , snap-on visor.', 6743),
 (11, 'Long-Sleeve Logo Jersey, L', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 6592),
 (33, 'Sport-100 Helmet, Black', 'Universal fit, well-vented, lightweight , snap-on visor.', 6532),
 (33, 'Sport-100 Helmet, Red', 'Universal fit, well-vented, lightweight , snap-on visor.', 6266),
 (1, 'Classic Vest, S', 'Light-weight, wind-resistant, packs to fit into a pocket.', 4247),
 (114, 'Patch Kit/8 Patches', 'Includes 8 different size patches, glue and sandpaper.', 3865),
 (32, 'Short-Sleeve Classic Jersey, XL', 'Short sleeve classic breathable jersey with superior moisture control, front zipper, and 3 back pockets.', 3864),
 (11, 'Long-Sleeve Logo Jersey, M', 'Unisex long-sleeve AWC logo microfiber cycling jersey', 3636)]

<h3>Exercise 5:</h3>
<p>Let's look at the correlation between quantity sold and price for each item in each subcategory. Some subcategories don't have enough sales to make the correlation meaningful, so only look at the top 10 subcategories by total quantity of sales.</p>
<p>Once you've looked at the data, make a hypothesis about what causes any positive or negative correlations between price and quantity, and explain this in 2-3 sentences.</p>
<p><strong>Hint:</strong> You'll need to calculate the total quantities from <code>salesorderdetail</code> again and group the products by subcategory. It'll probably be easier if you use at least two <a href="https://www.postgresql.org/docs/9.1/queries-with.html">CTEs</a>. You can calculate the correlation in PostgreSQL by using the built-in <a href="https://www.postgresql.org/docs/9.4/functions-aggregate.html"><code>corr()</code></a> function.</p>

**Answer.**

it shouldn't have a strong correlation because it is evident that the price doesn't have influence on the sale quantity, you cannot see coherence between them, there are products with low prices and some of them have a good sales while others of them not and the same thing occurs with products with hight prices

In [85]:
%%sql
WITH subcat as (select productsubcategoryid, SUM(OrderQty) as Total from product as p1 
        join salesorderdetail as p2 on p1.productid=p2.productid 
        GROUP BY productsubcategoryid ORDER BY Total DESC LIMIT 10),

prod_cat as (select p1.productid, SUM(OrderQty) as Total, unitprice from product as p1 
        join salesorderdetail as p2 on p1.productid=p2.productid 
        where productsubcategoryid IN (select productsubcategoryid from subcat )
        GROUP BY p1.productid, p2.unitprice)

select corr(total,unitprice) from prod_cat
        ;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
1 rows affected.

[(-0.219574992129683,)]

**Answer.**

Exercise 5:
Find the top five performing salespeople by using the salesytd (Sales, year-to-date) column. (We only need to know the businessentityid for each salesperson as this uniquely identifies each.) Why might you be skeptical of these numbers right now?

In [87]:
%%sql
select businessentityid from salesperson ORDER BY salesytd DESC LIMIT 5;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
5 rows affected.

[(276,), (289,), (275,), (277,), (290,)]

In [ ]:
Because saleslastyear could be cero

## <h3>Exercise 6:</h3>
<p>Using <code>salesorderheader</code>, find the top 5 salespeople who made the most sales <strong>in the most recent year</strong> (2014). (There is a column called <code>subtotal</code> - use that.) Sales that do not have an associated salesperson should be excluded from your calculations and final output. All orders that were made within the 2014 calendar year should be included.</p>
<p><strong>Hint:</strong> You can use the syntax <code>'1970-01-01'::date</code> to generate an arbitrary date in PostgreSQL and compare this to specific dates in the tables.</p>

**Answer.**

In [114]:
%%sql
select salespersonid,SUM(subtotal) as Tsale from salesorderheader WHERE salespersonid is not null and orderdate>='2014-01-01' and orderdate<='2014-12-31' GROUP BY salespersonid ORDER BY tsale DESC LIMIT 5;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
5 rows affected.

[(289, 1382996.5839),
 (276, 1271088.5216),
 (275, 1057247.3786),
 (282, 1044810.8277),
 (277, 1040093.4071)]

<h3>Exercise 7:</h3>
<p>Looking at the documentation, you will see that <code>subtotal</code> in the <code>salesorderheader</code> table is calculated from other tables in the database. To validate this figure (instead of trusting it blindly), let's calculate <code>subtotal</code> manually. Using the <code>salesorderdetail</code> and <code>salesorderheader</code> tables, calculate the sales for each salesperson for <strong>this past year</strong> (2014) and display results for the top 5 salespeople.</p>
<p><strong>Hint:</strong> You will have to <code>JOIN</code> <code>salesorderdetail</code> on <code>salesorderheader</code> to get the salesperson, calculate line totals for each sale using appropriate discounts, then sum all the line totals to get the total sale. You will want to use <code>WITH</code> clauses again to keep things sane.</p>

**Answer.**

In [119]:
%%sql
select salespersonid, sum(orderqty*unitprice) as ST from salesorderheader as p join salesorderdetail as p1 on p.salesorderid=p1.salesorderid where salespersonid is not null and orderdate>='2014-01-01' and orderdate<='2014-12-31' group by salespersonid ORDER BY ST DESC LIMIT 5;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
5 rows affected.

[(289, 1387765.58),
 (276, 1281334.5927),
 (275, 1060241.8254),
 (282, 1047766.1899),
 (277, 1042438.2767)]

<h3>Exercise 8:</h3>
<p>Using <code>corr()</code>, see if there is a positive relationship between total sales and commission percentage.</p>

**Answer.**--->ALL YEARS!!!!

In [125]:
%%sql
with table1 as (
select salespersonid, sum(orderqty*unitprice) as ST from salesorderheader as p join salesorderdetail as p1 on p.salesorderid=p1.salesorderid where salespersonid is not null  group by salespersonid),

table2 as (select salespersonid,ST, commissionpct from table1 as t1 join salesperson as t2 on t1.salespersonid=t2.businessentityid )

select corr(ST, commissionpct) from table2

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
1 rows affected.

[(0.438131838436976,)]

<h3>Exercise 9:</h3>
<p>Remember how we mentioned that products were sold in many regions? This is why you had to work with the <code>culture</code> value before to get the English language descriptions. To make matters worse, you are told the sales are recorded in <strong>local</strong> currency, so your previous analysis is flawed, and you must convert all amounts to USD if you wish to compare the different salespeople fairly!</p>
<p>Use the <code>countryregioncurrency</code> table in combination with the <code>salesperson</code> and <code>salesterritory</code> ones to figure out the relevant currency symbol for each of the top salespeople.</p>

**Answer.**

In [130]:
%%sql
select businessentityid,currencycode from (select businessentityid,p1.territoryid,countryregioncode from salesperson as p1 join salesterritory as p2 on p1.territoryid=p2.territoryid) a
    join countryregioncurrency as s on s.countryregioncode=a.countryregioncode

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
32 rows affected.

[(275, 'USD'),
 (275, 'USD'),
 (276, 'USD'),
 (276, 'USD'),
 (277, 'USD'),
 (277, 'USD'),
 (278, 'CAD'),
 (278, 'CAD'),
 (279, 'USD'),
 (279, 'USD'),
 (280, 'USD'),
 (280, 'USD'),
 (281, 'USD'),
 (281, 'USD'),
 (282, 'CAD'),
 (282, 'CAD'),
 (283, 'USD'),
 (283, 'USD'),
 (284, 'USD'),
 (284, 'USD'),
 (286, 'AUD'),
 (286, 'AUD'),
 (288, 'DEM'),
 (288, 'EUR'),
 (288, 'DEM'),
 (288, 'EUR'),
 (289, 'GBP'),
 (289, 'GBP'),
 (290, 'EUR'),
 (290, 'FRF'),
 (290, 'EUR'),
 (290, 'FRF')]

<h3>Exercise 10:</h3>
<p>Now that we have the currency codes associated with each salesperson, redo Exercise 7 to take the currency exchange into account. If there are salespeople in the top 5 that weren't there before, explain why.</p>
<p><strong>Hint:</strong> The rates in the<code>currencyrate</code> table always go from <code>FromCurrencyCode=USD</code> to <code>ToCurrencyCode=&lt;Desired Currency Code&gt;</code>, and they are listed every day. When calculating line totals, use the <code>AverageRate</code> for that day. You should be able to reuse a lot of Exercise 7.</p>

**Answer.**

In [136]:
%%sql
with cu as (
select businessentityid,currencycode from (select businessentityid,p1.territoryid,countryregioncode from salesperson as p1 join salesterritory as p2 on p1.territoryid=p2.territoryid) a
    join countryregioncurrency as s on s.countryregioncode=a.countryregioncode)
    
select h.salespersonid, SUM(rat*ST) as total from
(select salespersonid,ST,CASE WHEN currencycode='USD' THEN 1 ELSE (1/averagerate) END as rat from (
select salespersonid,ST,currencycode,orderdate from (
                        select salespersonid, sum(orderqty*unitprice) as ST, orderdate 
                         from salesorderheader as p join salesorderdetail as p1 
                        on p.salesorderid=p1.salesorderid where salespersonid is not null and
                        orderdate>='2014-01-01' and orderdate<='2014-12-31' 
                        group by salespersonid,orderdate) z
    join cu on cu.businessentityid=z.salespersonid )y 
 join currencyrate as u on y.currencycode=u.tocurrencycode and y.orderdate=u.currencyratedate)h
group by h.salespersonid order by total DESC LIMIT 5;

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
5 rows affected.

[(289, 4307595.14800313),
 (276, 2562669.1854),
 (275, 2120483.6508),
 (277, 2084876.5534),
 (290, 1695960.66702593)]

<h3>Exercise 11:</h3>
<p>How does the correlation from Exercise 8 change once you've adjusted for the currency?</p>

**Answer.** ALL YEARS!!!!!!

In [146]:
%%sql
with cu as (
select businessentityid,currencycode from (select businessentityid,p1.territoryid,countryregioncode from salesperson as p1 join salesterritory as p2 on p1.territoryid=p2.territoryid) a
    join countryregioncurrency as s on s.countryregioncode=a.countryregioncode),
fin as (    
select h.salespersonid, SUM(rat*ST) as total from
(select salespersonid,ST,CASE WHEN currencycode='USD' THEN 1 ELSE (1/averagerate) END as rat from (
select salespersonid,ST,currencycode,orderdate from (
                        select salespersonid, sum(orderqty*unitprice) as ST, orderdate 
                         from salesorderheader as p join salesorderdetail as p1 
                        on p.salesorderid=p1.salesorderid where salespersonid is not null
                        group by salespersonid,orderdate) z
    join cu on cu.businessentityid=z.salespersonid )y 
 join currencyrate as u on y.currencycode=u.tocurrencycode and y.orderdate=u.currencyratedate)h
group by h.salespersonid
),
table2 as (select salespersonid,total, commissionpct from fin as t1 join salesperson as t2 on t1.salespersonid=t2.businessentityid )

select corr(total, commissionpct) from table2

 * postgresql://postgres:***@bootcamprds.cemrpii4vl7l.us-east-2.rds.amazonaws.com/postgres
1 rows affected.

[(0.0170355418252231,)]